robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/src/2FOC.c
    /////////////////////////////////////

    *IqRef = IqRef_fake;

    int encoder = encoder_fake;

    while (encoder >= 360) encoder -= 360;
    while (encoder <    0) encoder += 360;

    return encoder;
}

// DMA0 IRQ Service Routine used for FOC loop

volatile int Iafbk = 0;
volatile int Icfbk = 0;
volatile int ElDegfbk = 0;
volatile int CurLimfbk = 0;
volatile int VqFbk = 0;
volatile int IqFbk = 0;

void __attribute__((__interrupt__, no_auto_psv)) _DMA0Interrupt(void)
{
    int Vq = 0;

    static const int cos_table[] = {32767,32763,32748,32723,32688,32643,32588,32523,32449,32364,32270,32165,32051,31928,31794,31651,31498,31336,31164,30982,30791,30591,30381,30163,29935,29697,29451,29196,28932,28659,28377};
    static const int sin_table[] = {    0,  330,  660,  990, 1319, 1648, 1977, 2305, 2632, 2959, 3285, 3609, 3933, 4255, 4576, 4896, 5214, 5531, 5846, 6159, 6470, 6779, 7087, 7392, 7694, 7995, 8293, 8588, 8881, 9171, 9459};

    static int *ppwmH = NULL, *ppwmL = NULL, *ppwm0 = NULL;
    static int Va = 0, Vb = 0, Vc = 0;

    static short *iH,*iL,*i0;

    static BOOL starting = TRUE;

    // setting CORCON in this way rather than using CORCONbits is
    // slightly more efficient (because CORCONbits is volatile and
    // optimizer cannot collapse multiple bit operations)
    CORCON = 0b11110100;

    // read and compensate ADC offset by MeasCurrParm.Offseta, Offsetb, Offsetc
    // scale currents by MeasCurrParm.qKa, qKb, qKc
    // Calculate ParkParm.qIa, qIb, qIc

    // read and compensate ADC offset by MeasCurrParm.Offseta, Offsetc
    // scale currents by MeasCurrParm.qKa, qKc
    
    short Ia_raw = (int)(__builtin_mulss(MeasCurrParm.Offseta-ADCBuffer[0],MeasCurrParm.qKa)>>14); // TEST 
    short Ic_raw = (int)(__builtin_mulss(MeasCurrParm.Offsetc-ADCBuffer[1],MeasCurrParm.qKc)>>14); // TEST
    
    // Ix_raw = 64 is equal to 49.03 mA current here
    // since we have 10 bits resolution, left aligned, with LSB = 49.03 mA
    
    // gain = 64/49.03
    
    static short Ia_raw_old = 0, Ic_raw_old = 0;
    
    ParkParm.qIa = (Ia_raw+Ia_raw_old)/3;
    ParkParm.qIc = (Ic_raw+Ic_raw_old)/3;
    
    Ia_raw_old = Ia_raw;
    Ic_raw_old = Ic_raw;
    
    // gain = (64/49.03) * (2/3)
    
    Iafbk = Ia_raw;
    Icfbk = Ic_raw;
    
    ParkParm.qIb = -ParkParm.qIa-ParkParm.qIc;

    int enc = 0;
    static int enc_start_sec = 0;
    BOOL has_speed_sample = FALSE;

    if (MotorConfig.has_qe)
    {
        // overwrite encoders during alignment
        if (sAlignInProgress)
        {
            enc = alignRotor(&IqRef);
        }
        else
        {
            enc = QEgetElettrDeg();
            ElDegfbk = enc;
        }
    }

    has_speed_sample = updateOdometry();

    // enc is in [0 - 360) range here

    char sector = 0;

    if (MotorConfig.has_hall)
    {
#ifdef R1_UPPER_ARM
        static const char dhes2sector[] = {0,2,6,1,4,3,5}; // R1 upper arm
#elif defined(MECAPION)
        static const char dhes2sector[] = {0,6,4,5,2,1,3}; // r1
#else
        static const char dhes2sector[] = {0,6,2,1,4,5,3}; // icub
#endif

        sector = dhes2sector[DHESRead()];
    }
    else
    {
        sector = 1 + enc/60;
    }

    static char sector_stored = 0;
    static char sector_stored_old = 0;

    if (sector_stored != sector)
    {
        if (MotorConfig.has_speed_qe)
        {
            unsigned int poscnt = QEgetRaw();
            static unsigned int poscnt_old = 0x7FFF;

            if (!sAlignInProgress)
            {
                if (poscnt_old == poscnt)
                {
                    if (sector_stored_old != sector)
                    {
                        gEncoderError.phase_broken = TRUE;
                    }
                }
                else
                {
                    poscnt_old = poscnt;
                }
            }
        }

        if (MotorConfig.has_qe)
        {
            if (MotorConfig.has_hall)
            {
                unsigned int poscnt = QEgetRaw();
                static unsigned int poscnt_old = 0x7FFF;
                if (poscnt_old == poscnt)
                {
                    if (sector_stored_old != sector)
                    {
                        gEncoderError.phase_broken = TRUE;
                    }
                }
                else
                {
                    poscnt_old = poscnt;
                }

                if (sector==1 && sector_stored==6) // positive
                {
                    enc_start_sec = enc+30;
                    if (enc_start_sec >=360) enc_start_sec -=360;
                }
                else if (sector==6 && sector_stored==1) // negative
                {
                    enc_start_sec = enc-30;
                    if (enc_start_sec <   0) enc_start_sec +=360;
                }
                else if (sector>sector_stored)
                { // positive rotation
                    enc_start_sec = enc+30;
                    if (enc_start_sec >=360) enc_start_sec -=360;
                }
                else
                { // negative rotation
                    enc_start_sec = enc-30;
                    if (enc_start_sec <   0) enc_start_sec +=360;
                }
            }
        }

        sector_stored_old = sector_stored;
        sector_stored = sector;

        #define HI(Ix,Vx) iH = &(ParkParm.Ix); ppwmH = &Vx;
        #define LO(Ix,Vx) iL = &(ParkParm.Ix); ppwmL = &Vx;
        #define NE(Ix,Vx) i0 = &(ParkParm.Ix); ppwm0 = &Vx;

        switch (sector) // original
        {
            case 1: HI(qIa,Va) LO(qIb,Vb) NE(qIc,Vc) break; // 1 0 1   5 -> 1
            case 2: HI(qIa,Va) LO(qIc,Vc) NE(qIb,Vb) break; // 1 0 0   4 -> 2
            case 3: HI(qIb,Vb) LO(qIc,Vc) NE(qIa,Va) break; // 1 1 0   6 -> 3
            case 4: HI(qIb,Vb) LO(qIa,Va) NE(qIc,Vc) break; // 0 1 0   2 -> 4
            case 5: HI(qIc,Vc) LO(qIa,Va) NE(qIb,Vb) break; // 0 1 1   3 -> 5
            case 6: HI(qIc,Vc) LO(qIb,Vb) NE(qIa,Va) break; // 0 0 1   1 -> 6
        }
    }

    BOOL negative_sec = sector%2;

    int delta = 0;

