robotology/icub-firmware/emBODY/eBcode/arch-dspic/board/2foc/appl/2FOC-V3/src/2FOC.c
    // reset timeout counter that is used to wait for the PWM registers update
    int timeout = PWMSAFETIME;

    //     PWM count DN               PWM count < PWM_SAFE_TIME
    while ((P1TMR & 0x8000) && ((P1TMR & 0x7fff) < PWMSAFETIME))
    {
        pwm_delayed = TRUE;

        if (!--timeout)
        {
            SysError.FirmwarePWMFatalError = TRUE;
            FaultConditionsHandler();
            break;
        }
    }

    if (gSetpointWatchdog>0)
    {
        if (!--gSetpointWatchdog)
        {
            SysError.SetpointExpired = TRUE;
            FaultConditionsHandler();
        }
    }
    
    
////////////////////////////////////////////////////////////////////////////
// CURRENT FILTER
    
    static long Vacc = 0;
    static long Iacc = 0;
    static char cntr = 0;
    static int Imax1 = 0x8000;
    static int Imin1 = 0x7FFF;
    static int Imax2 = 0x8000;
    static int Imin2 = 0x7FFF;
    static int Imax3 = 0x8000;
    static int Imin3 = 0x7FFF;
    
    if (I2Tdata.IQMeasured < Imin1)
    {
        Imin3 = Imin2;
        Imin2 = Imin1;
        Imin1 = I2Tdata.IQMeasured;
    }
    else if (I2Tdata.IQMeasured < Imin2)
    {
        Imin3 = Imin2;
        Imin2 = I2Tdata.IQMeasured;
    }        
    else if (I2Tdata.IQMeasured < Imin3)
    {
        Imin3 = I2Tdata.IQMeasured;
    }
    
    if (I2Tdata.IQMeasured > Imax1)
    {
        Imax3 = Imax2;
        Imax2 = Imax1;
        Imax1 = I2Tdata.IQMeasured;
    }
    else if (I2Tdata.IQMeasured > Imax2)
    {
        Imax3 = Imax2;
        Imax2 = I2Tdata.IQMeasured;
    }        
    else if (I2Tdata.IQMeasured > Imax3)
    {
        Imax3 = I2Tdata.IQMeasured;
    }
        
    Vacc += Vq<<VOLT_REF_SHIFT;
    Iacc += I2Tdata.IQMeasured;
    
    if (++cntr == 20)
    {
        cntr = 0;
        
        Iacc -= Imin1+Imax1+Imin2+Imax2+Imin3+Imax3;
        
        IqFbk = __builtin_divsd(Iacc,14);
        VqFbk = __builtin_divsd(Vacc,20);
        
        Iacc = Vacc = 0;
        Imax1 = Imax2 = Imax3 = 0x8000;
        Imin1 = Imin2 = Imin3 = 0x7FFF;
    }

    //
    ////////////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    // inv transform and PWM drive
    int V1 = (int)(__builtin_mulss(Vq,cosT)>>15)-3*(int)(__builtin_mulss(Vd,sinT)>>15);
    int V2 = (int)(__builtin_mulss(Vq,sinT)>>15)+  (int)(__builtin_mulss(Vd,cosT)>>15);

    if (negative_sec) V2=-V2;

    *ppwmH =  V1-V2;
    *ppwm0 =  V2+V2;
    *ppwmL = -V1-V2;

    pwmOut(Va,Vb,Vc);
    //
    ////////////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    // Invoke the I2T integrator with new current values

    if (!MotorConfig.has_tsens)
    {
        static int i2t_undersampler = 0;

        if (++i2t_undersampler >= 20)
        {
            i2t_undersampler = 0;

            I2Twatcher();
        }
    }

    //
    ////////////////////////////////////////////////////////////////////////////

    ////////////////////////////////////////////////////////////////////////////
    //Clear the DMA0 Interrupt Flag
    IFS0bits.DMA0IF = 0;
}

// When the 2foc loop is not running, the aux service timer
// (hw timer3) will avoid starving of I2T and Encoder services.
// I2T shall continue to discharge integrated data, and
// Encoder service shall mantain turn count in case of
// external torques rotates the axis.

void EnableAuxServiceTimer()
{
    // Enable the aux timer
    Timer3Enable();
}

// When the 2FOC loop is enabled, all core services shall
// run on its behalf.
// In particular I2T and Encoder services are moved from the
// aux timer to the 2FOC loop context.

void DisableAuxServiceTimer()
{
    // do not reschedule the aux timer anymore..
    Timer3Disable();
}

void DriveInit()
// Perform drive SW/HW init
{
    pwmInit(PWM_50_DUTY_CYC, DDEADTIME, PWM_MAX /*pwm max = 80%*/);
    
    // setup and perform ADC offset calibration in MeasCurrParm.Offseta and MeasCurrParm.Offsetc
    ADCDoOffsetCalibration();

#if 0  // to be moved to EnableDrive() but to be tested before  
    pwmON();

    int pwm3_00 = PWM_MAX / 25;

    pwmOut(pwm3_00, -2*pwm3_00, pwm3_00);
    
    int d;
    
    for (d=0; d<5000; ++d) __delay32(4000); // 500 ms
    
    ADCDoGainCalibration();

    pwmOFF();
#endif
    
    // Enable DMA interrupt, arm DMA for transfer
    ADCConfigPWMandDMAMode();

    // Setup timer for velocity calculation and velocity control loop
    //Timer2Config();

    // Setup timer for CAN periodic send
    // Timer4Config();

    // setup Hw related parameters (current gain, ecc...)
    SetupHWParameters();

    // define default control strategy *only*one*can*be*activated*
    SysStatus.b[0] = 0;

    // zero control set-point
    ZeroControlReferences();

    // Enables the external fault (pushbutton) interrupt
    ExternalFaultEnable();

    // Init timer for setpoint timeout.
    // Note: the timer has to be configured *after*
    // loading eeprom, otherwise the timeout value
    // to set in the timer registers is not known..
    //Timer5Config();
}

inline void I2Twatcher(void) __attribute__((always_inline));
inline void I2Twatcher(void)
{
    I2Tacc += (__builtin_mulss(I2Tdata.IQMeasured,I2Tdata.IQMeasured) - I2nom) >> 10;

    if (I2Tacc < 0) I2Tacc = 0;

    if (I2Tacc > I2Tlimit)
    {
        //The temperature grew too much. Protect!
        SysError.I2TFailure = TRUE;
        FaultConditionsHandler();
    }
}

void EnableDrive()
{
    bDriveEnabled = 1;
    
    static BOOL uncalibrated = TRUE;
    
#if 1
    if (uncalibrated)
    {
        uncalibrated = FALSE;
    
        pwmON();

        int pwm3_00 = PWM_MAX / 25;

        pwmOut(pwm3_00, -2*pwm3_00, pwm3_00);
    
        int d;
    
        for (d=0; d<5000; ++d) __delay32(4000); // 500 ms
    
        ADCDoGainCalibration();

        pwmOFF();
    }
#endif

    Timer3Disable();

    pwmZero();

    // Arm all the automation (PWM->ADC->DMA->FOC) but don't start yet!
    ADCInterruptAndDMAEnable();

